{
    "zsh-autosuggestions": "Sugiere comandos basados en tu historial mientras escribes. ¡Esencial para la velocidad!",
    "zsh-syntax-highlighting": "Colorea tus comandos en tiempo real. Verde si es correcto, rojo si hay error.",
    "fzf-tab": "Convierte el menú de tabulación en una búsqueda interactiva potente usando FZF.",
    "zsh-completions": "Añade superpoderes de autocompletado para cientos de comandos de desarrollo y sistema.",
    "command-not-found": "Si te equivocas de comando, te dice qué paquete instalar para tenerlo disponible.",
    "zsh-history-substring-search": "Escribe parte de un comando anterior y búscalo rápido con las flechas Arriba/Abajo.",
    "zsh-autopair": "Cierra automáticamente paréntesis, llaves y comillas mientras escribes.",
    "magic-enter": "Pulsa Enter en un prompt vacío para ejecutar automáticamente 'ls' o 'git status'.",
    "fancy-ctrl-z": "Alterna entre tu proceso en segundo plano (como un editor) y la terminal al instante con Ctrl+Z.",
    "k": "Un reemplazo de 'ls' con esteroides: muestra pesos de archivo, iconos y estado de Git.",
    "per-directory-history": "Mantiene historiales separados para cada carpeta. Ideal para no mezclar comandos de proyectos.",
    "zsh-navigation-tools": "Menús interactivos (estilo ncurses) para navegar por historial, procesos y archivos.",
    "alias-tips": "Si escribes un comando largo y tienes un alias corto definido, este plugin te lo recuerda.",
    "zoxide": "El 'cd' inteligente que aprende tus rutas. Usa 'z carpeta' para saltar a donde quieras al instante.",
    "eza": "El reemplazo moderno de 'ls'. Con iconos, colores brillantes y mejor organización de archivos.",
    "bat": "Un reemplazo de 'cat' con resaltado de sintaxis, integración con Git y números de línea.",
    "yazi": "Explorador de archivos terminal (TUI) ultra rápido escrito en Rust. Incluye previsualización de archivos.",
    "fzf": "Buscador difuso universal. Úsalo con Ctrl+R para el historial o Ctrl+T para archivos.",
    "fd": "Una alternativa simple y mucho más rápida que el comando 'find' tradicional.",
    "ripgrep": "El buscador de texto más rápido que existe. Alternativa moderna a 'grep'.",
    "duf": "Muestra el uso de disco de forma visual, colorida y mucho más clara que 'df'.",
    "ncdu": "Analizador de espacio en disco interactivo. Te ayuda a encontrar qué carpetas están llenas.",
    "procs": "Monitor de procesos moderno y colorido. Un reemplazo legible para el comando 'ps'.",
    "nala": "Frontend moderno para APT. Hace que instalar paquetes sea visualmente agradable y más rápido.",
    "tldr": "Manuales simplificados. Te da ejemplos prácticos de uso en lugar de páginas de manual aburridas.",
    "lazygit": "Interfaz visual increíble para Git. Gestiona commits, ramas y diffs sin salir de la terminal.",
    "glow": "Lector de archivos Markdown directamente en la terminal con un formato elegante.",
    "chafa": "Visualizador de imágenes en alta resolución directamente en la terminal.",
    "httpie": "Cliente HTTP moderno y amigable para probar APIs. Mucho más intuitivo que curl.",
    "jq": "La herramienta definitiva para procesar, filtrar y embellecer datos JSON desde la línea de comandos.",
    "neofetch": "Muestra el logo de tu sistema y especificaciones de hardware de forma estética.",
    "fastfetch": "Versión moderna y ultra rápida de neofetch. Escrita en C para un rendimiento instantáneo.",
    "lolcat": "Añade un efecto de arcoiris degradado a cualquier texto que salga por la terminal.",
    "nano": "Editor de texto sencillo y directo. El estándar para ediciones rápidas en Termux.",
    "extract": "Un solo comando ('x') para extraer cualquier archivo comprimido (.zip, .tar.gz, .rar, etc).",
    "web-search": "Busca en Google, DuckDuckGo, GitHub o YouTube directamente escribiendo en la terminal.",
    "copypath": "Copia la ruta absoluta de la carpeta actual al portapapeles con un comando corto.",
    "copyfile": "Copia el contenido íntegro de un archivo al portapapeles sin tener que abrirlo.",
    "cp": "Versión mejorada del comando de copia que incluye una barra de progreso real.",
    "gitignore": "Genera archivos .gitignore profesionales para tus proyectos usando el comando 'gi'.",
    "history": "Alias ultra cortos y potentes para manejar y buscar en tu historial de comandos.",
    "colored-man-pages": "Hace que las páginas de ayuda (man) sean mucho más fáciles de leer usando colores.",
    "safe-paste": "Protege tu terminal contra la ejecución accidental de comandos peligrosos al pegar texto.",
    "sudo": "Presiona ESC dos veces para añadir 'sudo' (o 'tsu' en Termux) al comando actual.",
    "git": "Colección masiva de alias (gst, ga, gp) que aceleran tu flujo de trabajo con Git.",
    "ansible": "Completado automático y alias para gestionar infraestructuras con Ansible.",
    "terraform": "Alias y completado para gestionar recursos en la nube con Terraform.",
    "kubectl": "Herramientas esenciales para gestionar clusters de Kubernetes desde la shell.",
    "tmux": "Gestiona sesiones persistentes de terminal con alias predefinidos para TMUX.",
    "z": "Plugin clásico de navegación rápida (reemplazado por zoxide, pero disponible).",
    "last-working-dir": "Vuelve automáticamente a la última carpeta abierta al iniciar una nueva sesión.",
    "vi-mode": "Activa los atajos de teclado de Vim en tu línea de comandos para editar como un pro.",
    "common-aliases": "Una colección de alias prácticos para comandos del día a día.",
    "gradle": "Completado y alias para el sistema de construcción de Java/Android Gradle.",
    "mvn": "Ahorra tiempo con alias para comandos de Maven.",
    "aws": "Completado interactivo para la CLI de Amazon Web Services.",
    "gcloud": "Completado y utilidades para Google Cloud SDK.",
    "ubuntu": "Alias específicos para la gestión de paquetes en sistemas Ubuntu/Debian.",
    "archlinux": "Alias y funciones útiles para usuarios de Arch Linux.",
    "brew": "Alias y completado para Homebrew, el gestor de paquetes de macOS/Linux.",
    "gitignore": "Plugin para generar archivos .gitignore desde la terminal.",
    "ssh-agent": "Inicia y gestiona tus llaves SSH automáticamente al entrar.",
    "rust": "Alias y completado para Cargo y el ecosistema de Rust.",
    "golang": "Configuración de entorno y alias para el lenguaje Go.",
    "ruby": "Alias para Ruby y gestión de gemas.",
    "rails": "Potencia tu flujo de trabajo en proyectos Ruby on Rails.",
    "laravel": "Alias y completado para el framework Laravel y su herramienta Artisan.",
    "composer": "Completado y alias para el gestor de dependencias PHP Composer.",
    "thefuck": "Corrige instantáneamente tu último comando fallido escribiendo 'fuck'.",
    "background-notify": "Te envía una notificación cuando un proceso largo termina en segundo plano.",
    "emoji": "Soporte para buscar e insertar emojis directamente desde tu prompt.",
    "battery": "Muestra el estado de carga y salud de tu batería en el prompt.",
    "taskwarrior": "Integración para gestionar tus listas de tareas pendientes con Taskwarrior.",
    "vscode": "Abre archivos y carpetas en Visual Studio Code rápidamente con el alias 'vsc'."
}
